In [ ]:
import pandas as pd
import numpy as np

<p>
Using the median we can detect an anomaly, like in this example
</p>

In [ ]:
x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4])

median = np.median(x)
th = 2
outliers = []
for item in x:
    if abs(item - median) > th:
        outliers.append(item)

print(outliers)

<p>
Detect an anomally using the mean or the standard desviation
</p>

In [ ]:
x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4])

mean = np.mean(x)
std = np.std(x)
outliers = []
for item in x:
    if (item < mean - std) or (item > mean + std):
        outliers.append(item)

outliers

<p>
Z  score to detect anomalys
</p>

In [ ]:
x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4])

mean = np.mean(x)
std = np.std(x)
outliers = []

for item in x:
    z_score = (item - mean) / std
    if z_score > 1.5:
        outliers.append(item)

print(outliers)

<p>
Interquatile Range for anomaly detection
</p>

In [ ]:
x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.5])
#obtain the percent element of the array
#x: panda series, [25, 75] element of 25% and 75%
Q1, Q3 = np.percentile(x, [25, 75])
IQR = Q3 - Q1
outliers = []
for item in x:
    if item < (Q1 - 1.5 * IQR) or item > (Q3 + 1.5 * IQR):
        outliers.append(item)

print(outliers)

In [ ]:
from numpy import NaN

data_1 = {'Name':['Edison', 'Edward', 'James', 'Neesham'], 'Age':[28, 27, NaN, 36]}

data = pd.DataFrame.from_dict(data=data_1)
data

In [ ]:
#This fuction return our dataframe with True values in the places where the values is null
#and False in the other case
data.isnull()

In [ ]:
#This function return the sum of null values on each columns and the type of the data
data.isnull().sum()

In [ ]:
data.dropna(inplace=True)
print(data)

In [ ]:
data.fillna(data.mean(), inplace=True)
data

In [ ]:
from numpy import NaN
data_2 = {'Name':['Edison', 'Edward','James', ' Neesham', 'Stuart'], 'Age':[28,27,NaN,36,27]}
data_f = pd.DataFrame.from_dict(data = data_2)
print(data_f)

In [ ]:
age_mode = data_f['Age'].mode()
print(age_mode)

In [ ]:
data_f['Age'].fillna(age_mode[0], inplace=True)
data_f

<p>
Regular expressions
</p>

In [ ]:
import re
txt = 'Python is my favourite programming language, I love Python.'
#find all the coincidences in txt of Python parameter
x = re.findall('Python', txt)
print(x , len(x))

In [ ]:
#find if the text stars with some pattern lets use ^ in the begining
y = re.findall('^Python', txt)
print(y, len(y))
#if we dont have any coincidence
txt_2 = 'I love Python'
y = re.findall('^Python', txt_2)
print(y, len(y))

In [ ]:
#two ways to found all numeric digits in a string
txt_3 = 'Python was released in 1991'
#individually
w = re.findall('\d', txt_3)
print(w, len(w))
#concatening
u = re.findall('\d+', txt_3)
print(u, len(u))

In [ ]:
l = ['Honduras', 'Costa Rica', 'Nicaragua', 'Guatemala', 'El Salvador', 'Honduras']
data_txt = pd.Series(l)
data_txt

In [ ]:
re.findall('Honduras', data_txt.to_string())

In [ ]:
txt_4 = 'Hello world'
match_object = re.search('world', txt_4)
print(match_object)

In [ ]:
#see the positions of our match
match_object.span()

In [45]:
txt_5 = 'C is my favourite programming language'
#pattern = the word or patter to find
#repl = pattern to sustitute
#string = the string what we need to change
re.sub(pattern='C', repl='Python', string=txt_5)

'Python is my favourite programming language'

<p>
Featuring Scaling
</p>

In [46]:
df1 = {'Age':[28, 27, 30, 36, 27], 'Salary':[10000, 15000, 11000, 11000, 13000]}
df = pd.DataFrame.from_dict(data=df1)
df

   Age  Salary
0   28   10000
1   27   15000
2   30   11000
3   36   11000
4   27   13000

In [49]:
df = (df - df.min()) / (df.max() - df.min())
df

        Age    Salary
0  0.914286  1.000000
1  1.000000  0.000000
2  0.727273  0.857143
3  0.000000  0.857143
4  1.000000  0.500000

In [50]:
df = (df - df.mean()) / df.std()
df

        Age    Salary
0  0.440598  0.883883
1  0.643667 -1.590990
2 -0.002461  0.530330
3 -1.725471  0.530330
4  0.643667 -0.353553

In [51]:
df.std()

Age       1.0
Salary    1.0
dtype: float64